carsparts/app/views/cars/_form.html.erb

    <%= form.label :make %>
    <%= form.collection_select :make_id, Make.all, :id, :name %>
---
SELECT "makes".* FROM "makes"

    <%= form.label :model %>
    <%= form.collection_select :make_id, Make.all, :id, :model %>
---
SELECT "makes".* FROM "makes"

    <%= form.label :part_id %>
    <%= form.collection_radio_buttons(:part_ids, Part.all, :id, :name) %>
---
SELECT "parts".* FROM "parts" WHERE 1=0