carsparts/app/views/cars/show.html.erb

SELECT  "makes".* FROM "makes" WHERE "makes"."car_id" = ? LIMIT ?  [["car_id", 1], ["LIMIT", 1]]
---
  <strong>Country:</strong>
  <%= @car.make.country %>

SELECT "parts".* FROM "parts" INNER JOIN "cars_parts" ON "parts"."id" = "cars_parts"."part_id" WHERE "cars_parts"."car_id" = ?  [["car_id", 1]]
---
  <strong>Part:</strong>
  <% @car.parts.each do |part| %>