carsparts/app/controllers/cars_controller.rb

SELECT  "makes".* FROM "makes" WHERE "makes"."car_id" = ? LIMIT ?  [["car_id", 1], ["LIMIT", 1]]
---
    def show
      @make = Make.all