carsparts/app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
    def index
      @cars = Car.all

SELECT "cars".* FROM "cars" WHERE (vin like '%77777777777777777%')
---
    def search
      @cars = Car.where("vin like ?", "%#{params[:search]}%")

SELECT "parts".* FROM "parts" WHERE 1=0
---
    def show
      @parts = Part.all

SELECT "parts".* FROM "parts" WHERE 1=0
---
    def new
      @car = Car.new
      @parts = Part.all

SELECT "parts".* FROM "parts" WHERE 1=0
---
    def edit
      @parts = Part.all

INSERT INTO "cars" ("created_at", "updated_at", "vin") VALUES (?, ?, ?)  [["created_at", "2019-11-23 00:28:44.835969"], ["updated_at", "2019-11-23 00:28:44.835969"], ["vin", 77777777777777777]]
---
    def create
      @car = Car.new(car_params)

      respond_to do |format|
        if @car.save

UPDATE "cars" SET "make_id" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["make_id", 4], ["updated_at", "2019-11-10 17:41:40.027090"], ["id", 7]]
---
    def update
      respond_to do |format|
        if @car.update(car_params)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 3]]
---
    def destroy
      @car.destroy

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def set_car
        @car = Car.find(params[:id])