carsparts/app/controllers/makes_controller.rb

  def index
    @makes = Make.all
---
SELECT "makes".* FROM "makes"

  def create
    @make = Make.new(make_params)

    respond_to do |format|
      if @make.save
---
INSERT INTO "makes" ("country", "created_at", "updated_at", "model", "name", "year") VALUES (?, ?, ?, ?, ?, ?)  [["country", "Japan"], ["created_at", "2019-10-03 21:42:21.816254"], ["updated_at", "2019-10-03 21:42:21.816254"], ["model", "Yaris"], ["name", "Toyota"], ["year", 2012]]

  def destroy
    @make.destroy
---
DELETE FROM "makes" WHERE "makes"."id" = ?  [["id", 1]]

    def set_make
      @make = Make.find(params[:id])
---
SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]