carsparts/app/controllers/parts_controller.rb

SELECT "parts".* FROM "parts"
---
  def index
    @parts = Part.all

SELECT "parts".* FROM "parts" WHERE (name like '%Tire%')
---
  def search
    @cars = Part.where("name like ?", "%#{params[:search]}%")

SELECT "cars".* FROM "cars"
---
  def new
    @part = Part.new
    @cars = Car.all

INSERT INTO "parts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Wheel"], ["created_at", "2019-11-15 01:53:00.697352"], ["updated_at", "2019-11-15 01:53:00.697352"]]
---
  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save

UPDATE "parts" SET "name" = ?, "updated_at" = ? WHERE "parts"."id" = ?  [["name", "d"], ["updated_at", "2019-10-04 19:46:41.499097"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @part.update(part_params)

DELETE FROM "cars_parts" WHERE "cars_parts"."part_id" = ?  [["part_id", 1]]
DELETE FROM "parts" WHERE "parts"."id" = ?  [["id", 13]]
---
  def destroy
    @part.destroy

SELECT  "parts".* FROM "parts" WHERE "parts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_part
      @part = Part.find(params[:id])